app/controllers/welcome_controller.rb

  def index

    # We will be creating a new student object to use with Register URL form
    @student = Student.new
    @students = Student.all
---
SELECT "students".* FROM "students"

  def create
    # Create a student
    # You can see the Students table id db/migrate
    @student = Student.new({:name =>params[:student][:name],:course => params[:student][:course]})

    respond_to do |format|
      # add the URL to the student
      # Ruby will give the URL the correct student_id
      if !(params[:student][:course] == 'cs132a' or params[:student][:course] == 'cis113')
        format.html { redirect_to  '/error'}
      else
        if params[:url] =~ /^http:\/\/\w+-\w*-\d{4}\.herokuapp.com\/?$/
          if @student.save and @student.urls.create!({:name => '',:url => params[:url]})
---
INSERT INTO "students" ("course", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["course", "Choose your course"], ["created_at", Tue, 30 Apr 2013 16:56:05 UTC +00:00], ["name", "dputnam"], ["updated_at", Tue, 30 Apr 2013 16:56:05 UTC +00:00]]
INSERT INTO "urls" ("comment", "created_at", "name", "student_id", "updated_at", "url") VALUES (?, ?, ?, ?, ?, ?)